const words = {
  2: ["ба", "лу", "еж", "пу", "яд", "рц", "бб"],
  3: ["акт", "атв", "бой", "бег", "бур", "бор", "атв", "акт", "бык", "бак", 
    "бар", "бот", "бес", "век", "вой", "вор", "вот", "всс", "все", "вип", 
    "вуй", "гав", "газ", "гид", "год", "гол", "гой", "где", "гум", "дом", 
    "дым", "Дюк", "дей", "дуб", "душ", "два", "для", "дул", "дэш", "дуо", 
    "джо", "ель", "еда", "ева", "Жак", "жар", "жим", "жир", "жук", "жор", 
    "зум", "зад", "Зак", "зал", "зек", "зло", "зуб", "зуд", "имя", "иод", 
    "ион", "ива", "йод", "код", "кот", "куб", "куш", "лцу", "лом", "люк", 
    "лут", "лак", "лещ", "лёд", "лик", "лис", "лоб", "лес", "лот", "луч", 
    "лук", "мед", "меч", "мех", "мяч", "мир", "мое", "Мот", "мыс", "нуб", 
    "нос", "нет", "нат", "нож", "ось", "Обь", "пар", "пыр", "пап", "пвп", 
    "пас", "пёс", "пир", "пук", "пол", "пух", "рев", "раб", "Рен", "раз", 
    "рад", "рай", "рей", "рек", "рис", "рог", "рис", "рот", "ряд", "рэп", 
    "рык", "рио", "сыр", "Сэм", "сад", "суп", "сом", "ток", "том", "тон", 
    "Тор", "той", "туя", "туф", "тир", "тук", "таз", "туз", "тык", "тюк", 
    "УЗИ", "ухо", "ушу", "усы", "фен", "фак", "фас", "фея", "Фет", "ход", 
    "хук", "хаб", "цук", "час", "чай", "Чак", "Чад", "чар", "шар", "шаг", 
    "шеф", "шея", "шум", "шур", "щит", "шок", "эхо", "эрл", "яма", "ясь", 
    "Янь", "ямь", "ярл", "с-4", "м16"],
  4:["алоэ", "амур", "авто", "база", "байк", "балу", "бета", "билл", "бинт", "бита", "блог", 
    "блок", "бокс", "болт", "босс", "брат", "буда", "букс", "вайс", "весы", "винт", 
    "влас", "вода", "воза", "волк", "вонь", "вояж", "вудс", "вуду", "вуса", "глаз", 
    "глас", "горы", "грег", "гриб", "груз", "гром", "джек", "диск", "дрон", "друг", 
    "дуло", "духи", "душа", "елка", "жало", "жнец", "заяц", "звук", "зима", "знак", 
    "зулу", "игры", "кадр", "кант", "кейс", "кедр", "кеды", "клан", "клей", "клуб", 
    "ключ", "кожа", "кожи", "корм", "коса", "косы", "кран", "крас", "крис", "кров", 
    "крой", "крюк", "кряк", "куст", "куча", "лика", "лист", "лифт", "лишь", "лофт", 
    "люкс", "люпа", "лямб", "майк", "медь", "метр", "мина", "миша", "мозг", "мост", 
    "мп5к", "мурав", "мужи", "мыло", "мясо", "мята", "небо", "неон", "ниан", "ниян", 
    "носи", "ночь", "нукс", "обед", "окно", "олди", "опыт", "орда", "отис", "пазл", 
    "пакт", "паек", "панк", "патч", "паук", "педь", "пень", "печь", "пиво", "пика", 
    "пища", "плед", "плен", "плис", "плот", "плющ", "подъ", "порт", "посы", "поток", 
    "пруд", "прут", "пули", "пуск", "путь", "пыль", "пятн", "рама", "ранг", "раны", 
    "рати", "раст", "рейд", "река", "рима", "риск", "рожа", "роса", "роща", "руда", 
    "рука", "руны", "рыба", "свет", "свин", "свит", "сейф", "сена", "сено", "сера", 
    "серп", "скат", "скит", "скин", "склад", "след", "слит", "слов", "слуг", "снуп", 
    "сова", "сорт", "спор", "став", "стол", "столб", "стук", "стул", "стык", "сума", 
    "сырь", "тали", "такс", "такт", "таки", "танк", "таун", "тень", "терк", "тигр", 
    "типа", "типс", "тони", "топи", "торф", "торт", "тоск", "трал", "трон", "труб", 
    "тунг", "турб", "турн", "тылы", "убор", "узел", "умер", "уран", "урод", "урон", 
    "фейд", "фенд", "финт", "флоэ", "флот", "фокс", "форт", "фото", "хаки", "хлам", 
    "хлеб", "хлоп", "хруп", "худи", "хули", "хуль", "хэш", "цвет", "цель", "чайк", 
    "часы", "чаща", "чело", "чили", "чипс", "чума", "чуть", "шаги", "шанс", "шкаф", 
    "шкив", "шлем", "шлюз", "шпон", "шрам", "штык", "щетк", "щука", "этаж", "юкка", 
    "язва", "ящик"],
  5: [
    "Джейк", "ковер", "смола", "вирус", "хакер", "склад", "отбор", "отпор", "скаут", "тягач",    
    "череп", "стена", "Харви", "спуск", "сигма", "грань", "блюдо", "текст", "пресс", "шапка", 
    "кровь", "спрей", "песок", "рикша", "запах", "факел", "лазер", "арена", "егерь", "болты", 
    "седло", "ведро", "камин", "следы", "софия", "трайк", "читер", "озеро", "лысак", "гараж", 
    "цевье", "удача", "дуэль", "схема", "зомби", "обеды", "багаж", "тушка", "доска", "домой", 
    "лодка", "мотор", "катер", "ферма", "кость", "тварь", "выход", "смена", "уголь", "объем", 
    "жилет", "талон", "порох", "жетон", "вышка", "кварц", "обмен", "масло", "мороз", "свист", 
    "хопеш", "время", "сезон", "столы", "лучик", "щенок", "медик", "бочка", "дверь", "ковры", 
    "почта", "макет", "бочки", "корги", "метро", "ретро", "набор", "поезд", "хаски", "пикап", 
    "сумка", "линза", "скоро", "миска", "штаны", "маска", "глушь", "лоток", "точка", "карта", 
    "папка", "крафт", "Такер", "стейк", "амбар", "титан", "карго", "тиран", "хорас", "ревун", 
    "огонь", "алыча", "умник", "сталь", "крамп", "папки", "шмель", "Китти", "ткань", "спирт", 
    "шланг", "мусор", "Наоми", "топор", "кирка", "ящики", "палец", "нитро", "кукри", "сошки", 
    "резня", "Шелби", "Лемми", "тесак", "олень", "общее", "центр", "крыша", "шруми", "рыбак", 
    "кубок", "Тимми", "кулер", "тиски", "шифер", "Ронин", "пицца", "бонус", "Рубик", "обрез", 
    "Бобби", "оскал", "ясень", "сёдзи", "сапер", "труба", "радио", "колья", "удача", "броню", 
    "виски", "осетр", "голод", "жажда", "земля", "балка", "страж", "трава", "купон", "недра", 
    "ложка", "вилка", "бегун", "бинты", "кошки", "карма", "кусок", "шедди", "дредд", "кокон", 
    "тыква", "обувь", "салют", "плита", "джули", "мафия", "броня", "кошка", "синий", "пират", 
    "техно", "рыбак", "армия", "тесто", "Клаус", "ягода", "санта", "леший", "роман", "слинг", 
    "мерфи", "холмы", "весло", "копье", "улики", "гамма", "пламя", "альфа", "шляпа", "ягоды", 
    "хэнки", "ротор", "рывок", "ванна", "отряд", "слева", "ак-47", "Акула", "Альфа", "Ангел", 
    "Арена", "Армия", "Багги", "Балка", "Бегун", "Билет", "Бинты", "Бобби", "Болты", "Бонус", 
    "Браво", "Броня", "Бугай", "Ванна", "Весло", "Вирус", "Виски", "Вожак", "Выход", "Вышка", 
    "Гараж", "Гарри", "Герой", "Глушь", "Голод", "Гости", "Грань", "Дверь", "Денис", "Джейк", 
    "Джейн", "Джули", "Диван", "Диета", "Домик", "Доска", "Дуэль", "Егерь", "Жажда", "Жилет", 
    "Знамя", "Зомби", "Иллая", "Камин", "Карго", "Карма", "Карта", "Катер", "Кварц", "Кейси", 
    "Кирка", "Китти", "Клаус", "Ковер", "Кокон", "Колья", "Копье", "Корги", "Кости","Кость",
    "Кошка", "Кошки", "Крамп", "Крафт", "Кровь", "Кукри", "Кулер", "Лазер", "Ленни", 
    "Леший", "Линза", "Маска", "Масло", "Медик", "Мерфи", "Метро", "Мечта", "Мешок", "ми-24", 
    "Мойка", "Молот", "Мотор", "Мусор", "Мушка", "Набор", "Навык", "Насос", "Нервы", "Нитки", 
    "Нитро", "Обеды", "Обрез", "Объем", "Огонь", "Окрас", "Окунь", "Олень", "Осетр", "Оскал", 
    "Охота", "Палка", "Пикап", "Пицца", "Плата", "Плита", "Полка", "Порох", "Почта", "Пресс", 
    "Радио", "Резак", "Резня", "Ретро", "Рикша", "Ромео", "Ронин", "Ротор", "Рояль", "Рубик", 
    "Руины", "Ручка", "Рыбак", "Санта", "Сапер", "Сброс", "Свеча", "Седзи", "Седло", "Сезон", 
    "Сигма", "Синий", "Скаут", "Склад", "Скотч", "Слинг", "Смесь", "Смола", "София", "Спирт", 
    "Спрей", "Ствол", "Стена", "Стенд", "Стоки", "Страж", "Схема", "Такер", "Тварь", "Текст", 
    "Техно", "Тиран", "Тиски", "Титан", "Ткань", "Топор", "Трайк", "Труба", "Турбо", "Тыквы", 
    "Тягач", "Уголь", "Удача", "Умник", "Факел", "Ферма", "Хакер", "Халат", "Ханна", "Харви", 
    "Хаски", "Хопеш", "Хэнки", "Цевье", "Чарли", "Чашка", "Череп", "Читер", "Шапка", "Шарик", 
    "Шахта", "Шашка", "Шелби", "Шифер", "Шишки", "Шкура", "Шланг", "Шляпа", "Шмель", "Шоссе", 
    "Шруми", "Штаны", "Штурм", "Ягоды", "Ясень", "Ящики", "Лирой", "Рывок", "Тимми", "Стиль", 
    "Шедди", "Хорас", "Кровь", "Пламя", "Недра"],
  6: ["бензин", "джинсы", "кактус", "турнир", "рюкзак", "вокзал", "ракшас", "арахна", "паллет", "фантом",
  "черепа", "эндуро", "защита", "уборка", "карбон", "прорыв", "ученик", "щебень", "власти", "турель",
  "ктулху", "дайнер", "дьявол", "бартер", "клумба", "деньги", "вампир", "асбест", "гитара", "бункер",
  "кратер", "фермер", "цунами", "машина", "клетка", "удочка", "рецепт", "пряник", "высота", "педаль",
  "падаль", "монеты", "Джошуа", "бревно", "древко", "друзья", "Маркус", "муэрто", "кувшин", "оружие",
  "джанго", "дерево", "кружка", "стакан", "шеврон", "опилки", "жетоны", "Рейчел", "кресло", "рейдер",
  "офицер", "ищейка", "цемент", "заявки", "пугало", "сакура", "ярость", "собака", "список", "цветок",
  "матрас", "объект", "порода", "термос", "убийца","тайник", "карьер", "камера", "ошибка",
  "резина", "победа","свалка", "платок", "триумф", "сборка", "станок", "чоппер", "погода",
  "шахтер", "сирена", "баллон", "гибрид", "плевун", "спринг", "истина", "тетива", "пещера", "детали",
  "столик", "ползун", "железо", "торшер", "лекарь", "мачете", "ритуал", "стекло", "крышки", "рекрут",
  "офицер", "ведьма", "карман", "Эврика", "грудка", "трямыч", "шурупы", "боксит", "грядка", "коврик",
  "гвозди", "Моррис", "каркас", "могила", "кабель", "дикарь", "путник", "сундук", "прораб", "навыки",
  "ментол", "клюшка", "флэшка", "паранг", "фильтр", "пикник", "карета", "ветряк", "валюта", "Вильям",
  "штанга", "турист", "мебель", "прочее", "коннор", "бедлам", "колесо", "ракета", "лопата", "черный",
  "ржавый", "аляска", "лошадь", "ловчий", "костер", "мастер", "борода", "Самайн", "матрос", "мотель",
  "чертеж", "колени", "ястреб", "дизайн", "крампи", "пагода", "ветряк", "талоны", "лучшее", "диабло",
  "годфри", "эмычтв", "сестра", "чайник", "семена", "россия", "ловкач", "молния", "вольер", "камень",
  "причал", "сердце", "ячейка", "форель", "справа", "унитаз", "состав", "тыквер", "эффект", "добыча",
  "билсон", "цунами", "капкан", "катана", "эллипс", "Аляска", "Арахна", "Асбест", "Байкер", "Баллон",
  "Бараки", "Баркер", "Бедлам", "Бензин", "Билсон", "Боксит", "Брикет", "Бритва", "Бульон", "Бункер",
  "Бургер", "Вампир", "Ведьма", "Ветряк", "Вивьен", "Вильям", "Власти", "Вокзал", "Гарпун", "Гвозди",
  "Гигант", "Гитара", "Глобус", "Годфри", "Грядка", "Дайнер", "Дельта", "Деньги", "Детали", "Джжонн",
  "Джинсы", "Джошуа", "Диабло", "Дикарь", "Добыча", "Дорога", "Дракон", "Древко", "Друзья", "Дьявол",
  "Железо", "Жетоны", "Затвор", "Захват", "Заявки", "Зиппер", "Золото", "Ищейка", "Камера", "Капкан",
  "Карбон", "Каркас", "Карман", "Карьер", "Катана", "Кексик", "Кирпич", "Клюшка", "Коврик", "Колчан", 
  "Компот", "Конвой", "Коннор", "кролик",
  "Костер", "Крампи", "Кратер", "Крикун", "Крышки", "Ксенос", "Куртка", "Курьер",
  "Л.е.д.", "Лагерь", "Лагерь", "Легкие", "Лекарь", "Лекарь", "Ловчий", "Лопата",
  "Лосось", "Лошадь", "Маркус", "Мастер", "Матрос", "Мачете", "Машина", "Мебель",
  "Ментол", "Миссия", "Мичман", "Молния", "Монеты", "Мотель", "Муэрто", "Мясник",
  "Насест", "Обжора", "Обжора", "Обивка", "Опилки", "Опушка", "Оружие", "Оружие",
  "Остров", "Ошибка", "Падаль", "Паллет", "Память", "Паранг", "Паркет", "Пароль",
  "Патрон", "Персия", "Пещера", "Пикник", "Платок", "Погоня", "Полоса", "Помехи",
  "Привал", "Пример", "Прицел", "Причал", "Провод","Прораб", "Прорыв",
  "Прочее", "Пряник", "Пугало", "Путник", "Разлом", "Ракета", "Ракета", "Ракшас",
  "Резина", "Рейдер", "Рейдер", "Рейдер", "Рейчел", "Ремень", "Ржавый", "Ритуал",
  "Роберт", "Россия", "Росток", "Рюкзак", "Сакура", "Сборка", "Свалка", "Свинец",
  "Сектор", "Семена", "Сестра", "Сигнал", "Сириус", "Слиток", "Снежки", "Снежок",
  "Состав", "Спирея", "Спринт", "Станок", "Старец", "Стекло", "Столик", "Сундук",
  "Сэмюэл", "Таллон", "Талоны", "Термос", "Тетива","Тостер", "Триумф",
  "Трэвис", "Туалет", "Турель", "Турист", "Турнир", "Тыквер", "Тюрьма", "Уборка",
  "Убощик", "Угроза", "Угрозы", "Удочка", "Удочка", "Уикэнд", "Улетай",
  "Ученик", "Ученый", "Фермер", "Флэшка", "Форель", "Фрукты", "ХК-416",
  "Хэнкок", "Цемент", "Цунами", "Чайник", "Черепа", "Черный", "Чоппер", "Шаркун",
  "Шахтер", "Шеврон", "Штанга", "Шурупы", "Щебень", "Эврика", "Эллипс", "Эмычтв",
  "Эндуро", "Ярость", "Ястреб", "Ячейка", "Модель", "Бревно", "Максим", "Могила","Боксит","Боксит","Боксит",
  "Самайн"],
  7: ["ресурсы", "франция", "обломки", "хохлома", "охотник", "уборщик", "бибосио","толстяк",
    "молоток", "трясина", "огнемет", "правила", "селитра", "чертежи", "верстак", "комунна",
    "гадость", "Джордан", "пустошь", "громила", "комфорт", "холодок", "америка", "верблюд",
    "чистюля", "кинетик", "симбиоз", "переезд", "завтрак", "ботинки", "авиатор", "гилберт",
    "коммуна", "перерыв", "хайкинг", "довыдыч", "скупщик", "пропуск", "шекспир", "морковь",
    "корешок", "челюсти", "возраст", "корабль", "якитори", "попкорн", "престиж", "трущобы",
    "блокнот", "ассорти", "алюминь", "ресурсы", "шипучка", "бунгало", "медведь", "найджел",
    "табурет", "базовый", "шахматы", "бутылка", "барбекю", "базовые", "кусачки", "лотерея",
    "фантазм", "кислота", "полярис", "задания", "шершень", "трещина", "мутации", "дрезина",
    "аптечка", "хардкор", "мозаика", "ножовка", "индейка", "телефон", "награда", "альпака",
    "нашивка", "либерти", "веревка", "пулемет", "катушка", "энергия", "дискета", "кувырок",
    "берсерк", "караван", "кумкват", "гашетка", "событие", "капитан", "маверик", "ядерный",
    "история", "военный", "горошек", "колледж", "стрелок", "мэлисон", "кровати", "генезис",
    "ёмкость", "арбалет", "стройка", "минивен", "каустик", "авокадо", "самопал", "пластик",
    "самолёт", "рудокоп", "стеллаж", "волокно", "самурай", "орхидея", "маверик", "апгрейд",
    "замочек", "зеркало", "саженец", "черешня", "красный", "колодец","кактусы",
    "реактив", "роллтоп", "кувалда", "аппарат", "рыбалка", "механик", "сюрприз", "обмотки",
    "зарядка", "ярмарка", "чесотка", "батарея", "рудольф", "записка", "леопард", "обычный",
    "снежный", "пиньята", "снайпер", "арсенал", "перерыв", "бунтарь", "граната", "вентиль",
    "пружина", "часовой", "пустыня", "комната", "зимовка","Вентиль", "Верблюд", "Веревка", 
    "Верстак", "Военные", "Военный", "Выстрел", "Вытяжка", 
    "Глок-17", "Горелка", "Горошек", "Граната", "Графика", 
    "Джорджи", "Домосед", "Дрезина", "Духовка", "Живодёр", "Жилетка", "Завтрак", "Загадки", 
    "Задания", "Закалка", "Зеркало", "Зимовка", "Индейка", "Инженер", "Истории", "Кактусы", 
    "Капитан", "Катушка", "Каустик", "Кинетик", "Кинолог", "Кислота", "Колледж", "Колодец", 
    "Колючки", "Коммуна", "Комната", "Комфорт", "Контакт", "Корабль", "Корешки", "Коробка", 
    "Котлеты", "Красный", "Кровать", "Кувалда", "Кувырок", "Кумкват", "Кусачки", "Легенда", 
    "Ледокол", "Леопард", "Лесенка", "Лесоруб", "Либерти", "Ловушки", "Маверик", "Магазин", 
    "Манекен", "Медведь", "Механик", "Минивен", "Миниган", "Миномет", "Мозаика", "Молоток", 
    "Морковь", "Мситель", "Мутации", "Мэлисон", "Награда", "Наемник", "Найджел", "Нашивка", 
    "Новости", "Ножовка", "Обитель", "Обломки", "Обломок", "Обмотки", "Обычный", "Овчарка", 
    "Огнемет", "Орхидея", "Охотник", "Ошейник", "Паразит", "Патроны", "Переезд", "Перепыв", 
    "Перерыв", "Печенье", "Пиньята", "Пластик", "Пленник", "Поворот", "Полоски", "Полярис", 
    "Престиж", "Приклад", "Припасы", "Прованс", "Провода", "Просека", "Пружина", "Пустошь", 
    "Пустыня", "Раствор", "Реактив", "Рейдеры", "Рейтинг", "Ресурсы", "Рецепты", "Роллтоп", 
    "Рубашка", "Рудокоп", "Рудольф", "рукоять", "Рыболов", "Рыскарь", "Рядовой", "Саженец", 
    "Саманта", "Самопал", "Самурай", "Селитра", "Сеятель", "Симбиоз", "Скупщик", "Снайпер", 
    "Событие", "Солдаты", "Станция", "Стебель", "Стеллаж", "Стрелок", "Стройка", "Сушилка", 
    "Табурет", "Тирания", "Толстяк", "Топливо", "Трущобы", "Трясина", "Убежище", "Уик-энд", 
    "Участок", "Фантазм", "Фейверк", "Фигурка", "Франция", "Хайкинг", "Хардкор", "Холодок", 
    "Хохлома", "Человек", "Челюсти", "Чемодан", "Черешня", "Чистюля", "Чувство", "Шахматы", 
    "Шершень", "Энергия", "Юджимбо", "Ядерный", "Яичница", "Ярмарка", "Апгрейд", "Отверка", 
    "Шипучка", "Якитори", "Попкорн"],
  8: ["Алебарда", "Алкоголь","Багрянец", "Бомбарда", "Бразилия", "Бригадир", "Буржуйка",
    "Бэд-байк", "Вездеход", "Везунчик", "Вертолет", "Весенний", "Вещество", "Вещество",
    "Винторез", "Витамины", "Выжившие", "Выжившие", "Выживший", "Гардероб", "Германия",
    "Горизонт", "Громилый", "Деректор", "Детектив", "Диверсия", "Добытчик", "Добытчик", "Доставки",
    "Драгомир", "Драгомир", "Драгстер", "Дробилка", "Дробовик", "Дровосек", "Единорог",
    "Загрузка", "Заправка", "Запчасти", "Запчасти", "Зачистка", "Защитник", "Здоровяк", "Изгородь",
    "Интерьер", "Иньекция", "Камуфляж", "Камуфляж", "Канистра", "Карамель", "Карнавал",
    "Классика", "Коктейль", "Командир", "Командир", "Конечная", "Консервы", "Контакты",
    "Кормушка", "Коррозия", "Костеруб", "Костолом","Культист", "Лабиринт", "Лампочка",
    "Левиафан", "Медицина", "Мини-узи", "Мойдодыр", "Мотоцикл", "Мотошлем", "Мучитель", "Наемники",
    "Наследие", "Нон-стоп", "Отбивная", "Отшельнк", "Очевидцы", "Партизан", "Персонал",
    "Пилорама","Пластина", "Подсумок", "Покрышка", "Похлебка", "Походный", "Приемник",
    "Призраки", "Приманка", "Пробирка", "Провиант", "Проводка", "Протокол", "Прохлада",
    "Прохлада", "Пушистик", "Пушистик", "Работяга","Разборки",
    "Разведка", "Развитие", "Раковина", "Расплата", "Растяжка", "Растяжка", "Резистор", "Резонанс",
    "Родители", "Розмарин", "Светофор", "Сердечки", "Скамейка", "Скороход", "Сладость",
    "Сластена", "Следопыт", "Снеговик", "Сноубайк", "Собачник", "Сосулька","Старснип",
    "Страйкер", "Странник", "Стритфуд", "Таблетка", "Таблетки", "Термопот", "Торговец",
    "Усиления", "Фокстрот", "Франклин", "Хеллоуин", "Целитель", "Цистерна",
    "Шкатулка", "Эволюшен", "Этажерка", "Цистерна", "Конфетти", "Зомбибол", "Энайолла", "Консервы", "Костеруб","Отвёртка",
    "Обновить", "Громилый", "Драгстер", "Кладовка", "Весенний", "Резистор", "Работяга", "Бразилия",
    "Провиант", "Гирлянда", "Литейная", "Кукуруза", "Левиафан", "Сигареты", "Растяжка", "Экономия",
    "Походный", "Драгомир","Здоровье", "Детектив", "Германия", "Багрянец", "Заправка",
    "Дробилка", "Пилорама", "Костолом", "Чудовище", "Светофор","Сластёна", "Радиация",
    "Добытчик", "Странник", "Вездеход", "Коррозия", "Цветочек", "Единорог",
    "Мститель", "Зачистка", "Конфетти", "Карнавал", "Следопыт", "Разрядки", "Животные",
    "Этажерка", "Инстинкт", "Алчность", "Сноубайк", "Вещество", "Вертолет", "Персонаж",
    "Термопот", "Изолента", "Разведка", "Средство", "Хеллоуин", "Раковина", "Неуязвим", "Винтовка",
    "Пилигрим", "Собачник", "Карамель", "Вышибала", "Грузовик", "Защитник", "Креветка",
    "Пушистик", "Меткость", "Скамейка", "Камуфляж", "Уровень4", "Дробовик", "Улучшить",
    "Скорость", "Взломщик", "Конечная", "Прохлада", "Партизан", "Скиталец", "Пасхалка",
    "Расплата", "Квартира", "Защитная", "Приправа", "Запчасти", "Праздник",
    "Командир", "Наследие", "Убивашка", "Цистерна", "Классика", "Дровосек", "Пригород", "Младенец",
    "Командир", "Мучитель", "Мотоцикл", "Пирожное", "Выживший", "Паразиты", "Уважение", "Стандарт"],
  9: [
    "Инвентарь", "Овердрайв", "Контейнер", "Отморозок", "Оживитель", "Диверсант", "Жемчужина", "Резонатор",
    "Перевязка", "Примавера", "Держатель", "Отшельник", "Квотербек", "Зажигалка", "Вершитель", "Вальдемар",
    "Подрывник", "Локомотив", "Глинтвейн", "Ведьмочка", "Сборочная", "Сковорода", "Грабитель", "Мороженое",
    "Энергетик", "Вредитель", "Мультитул", "Подсветка", "Хранилище", "Водокачка", "Предгорье", "Сохранить",
    "Уклонение", "Бейсболка", "Кофемолка", "Дистанция", "Водоросли", "Толстячок", "Хранитель", "Генератор",
    "Контракты", "Плавильня", "Черепашка", "Подшипник", "Мотообувь", "Подробнее", "Барракуда", "Фейерверк",
    "Детонатор", "Проволока", "Известняк", "Мотообувь", "Мотобрюки", "Пластинка", "Уклонения", "Компаньон",
    "Смышлёный", "Макуахутл", "Антирадин", "Транспорт", "Глушитель", "Падальщик", "Выживание", "Поражение",
    "Фестиваль", "Периферия", "Собаковод", "Облигации", "Кладовщик", "Выживашка", "Уединение", "Пряничный",
    "Выгрузить", "Настройки", "Браконьер", "Вредитель", "Дальность", "Подставка", "Проклятая", "Стенатель",
    "Прочность", "Оживитель", "Бомбардир", "Заполнить", "Сплочение", "Снабжение", "Столярная", "Дальномер",
    "Светлячок", "Стойкость", "Револьвер", "Параметры", "Заселение", "Крушитель", "DJ-Микшер", "Авторежим", "Адреналин", "Аммуниция", "Антирадин", "Арендатор","Батарейки",
    "Бейсболка", "Бешенство", "Бомбардир", "Бомбардир", "Браконьер", "Бум-палка", "Вальдемар", "Ведьмочка",
    "Вершитель", "Видимость", "Винчестер", "Водокачка", "Водокачка", "Водоросли", "Водоросли", "Возмездие",
    "Вредитель", "Выживание", "Выживашка", "Генератор", "Глинтвейн", "Глушитель", "Глушитель", "Грабитель",
    "Граммофон", "Дальномер", "Двигатель", "Декорация", "Детонатор", "Диверсант", "Диверсант", "Жемчужина",
    "Живучесть", "Зажигалка", "Зажигалка", "Замыкание", "Замыкание", "Заражение", "Известняк", "Ингалятор",
    "Календарь", "Кладовщик", "Компаньон", "Компаньон", "Контракты", "Контролер", "Кофемолка", "Лакомство",
    "Лихорадка", "Локомотив", "Локомотив", "Макуахутл", "Медведица", "Мороженое", "Мотобрюки", "Мотообувь",
    "Мразокунь", "Мультитул", "Настройки", "Натяжение", "Начальник", "Облигации", "Овердрайв", "Овсяночка",
    "Оживитель", "Остролист", "Падальщик", "Перевязка", "Перепутье", "Перифирия", "Плавильня", "Поддержка",
    "Подробнее", "Подрывник", "Подшипник", "Полотенце", "Помещения", "Помощница", "Поражение", "Поручение",
    "Поселение", "Поселение", "Похищение", "Предгорье", "Прикормка", "Примавера", "Проволока", "Процессор",
    "Пряничный", "Развалины", "Ракетница", "Револьвер", "Резонатор", "Светлячок", "Сковорода", "Смышленый",
    "Снабжение", "Собаковод", "Сообщение", "Сплочение", "стенатель", "Стойкость", "Строитель", "Табуретка",
    "Толстячок", "Транспорт", "Уединение", "Установка", "Установка", "Фестиваль", "Фундамент", "Хламовщик",
    "Хранилище", "Хранитель", "Черепашка", "Штурмовик", "Эвакуация", "Энергетик"],
  10: ["Антисептик", "Арендаторы", "Биореактор", "Вафельница", "Голограмма",
    "Гранатомет", "Динамитчик", "Дипломатия", "Заботливый", "Запасливый", "Зомби-воин", "Зонтичница",
    "Информация", "Камнерезка", "Катастрофа", "Ключ-карта", "Коллиматор", "Кофемашина", "Ликвидатор",
    "Ломтерезка", "Металлолом", "Микросхема", "Миротворец", "Монтировка", "Мотокуртка", "Мускульник",
    "Ограбление", "Окислитель", "Отчуждение", "Охладитель", "Очиститель",
    "Пожиратель", "Покохонтас", "Похититель", "Противогаз", "Радиовышка", "Разоритель", "Распродажа",
    "Расходники", "Реаниматор","Скворечник", "Скрытность", "Скульптура", "Снаряжение",
    "Специалист", "Спортивный", "Стервятник", "Транзистор", "Укротитель", "Ультиматум", "Умывальник",
    "Уравнитель", "Утопленник", "Шампанское", "Шестеренка", "Экипировка", "Экспедиция", "Выносливый",
    "Старейшина", "Сортировка","бронежилет", "посетители", "бессмертие", "проворство", "штрих-коды", "гранатомет",
    "биореактор", "координаты", "транзистор", "респиратор", "отчуждение", "подготовка",
    "спортивный", "металлолом", "экипировка", "координаты", "похититель", "мастерская", "кровопийца",
    "кофемашина", "термосумка", "автомобиль", "микросхема", "монтировка", "вентилятор",
    "взрывчатка","мотокуртка", "антибиотик", "разоритель", "автогруппа", "ликвидатор",
    "динамитчик", "шестеренка", "заботливый", "подстанция", "миротворец", "вафельница",
    "коллиматор", "устройства", "компаньоны", "уравнитель", "стервятник", "пожиратель", "экспедиции",
    "экспедиция",
    "укратитель", "Покахонтас", "уязвимости",
    "практичная"],
  11: [
    "лаборатория", "водосборник", "инструменты", "распылитель", "осмотреться", "аккумулятор", "сорвиголова",
    "нерушимость", "ремкомплект", "морозильник", "холодильник", "электроника", "разрушитель", "воскреснуть",
    "апартаменты", "компенсатор", "прихвостень", "трубопровод", "трансмиссия", "реставрация", "окрестности",
    "колокольчик", "потрошитель", "эксперимент", "исчезнувший", "раскладушка", "особенности", "счастливчик",
    "перекресток", "переигровка", "исступления", "отправитель", "способность", "наголенники", "продвинутые",
    "свежеватель", "док-станция", "аннигиляция", "аккумулятор", "аннигиляция", "водосборник", "водосборник", "гендиректор", "джаггернаут", "инструменты",
    "исступление", "исчезнувший", "катализатор", "колокольчик", "колокольчик", "компенсатор", "лаборатория",
    "морозильник", "наголенники", "осмотреться", "переигровка", "перекрёсток", "потрошитель", "прихвостень",
    "радиосигнал", "разрушитель", "разъедатель", "раскладушка", "распылитель", "ремкомплект", "реставрация",
    "самолечение", "свежеватель", "сорвиголова", "счастливчик", "счастливчик", "температура", "трубопровод",
    "уведомления", "уверенность", "холодильник", "эксперимент", "электроника"],
  12: [
    "аккуратность", "антирад-шлем", "военачальник", "всс-винторез", "исследование",
    "квадракоптер", "коллекционер", "кресло-мешок", "ненасытность", "обустройство", "перезарядник", 
    "популярность", "предсказание", "производство", "профессионал", "сверхприбыль",
    "электроплита","квадрокоптер", "подкрепление", "кастомизация", 
    "обслуживание", "автономность", "целеуказание", "сигнализация",
    "восстановить","длительность", "стабильность"],
    13: ["стекловолокно", "неудержимость", "исследователь", "администратор", "специализации",
    "безмятежность", "пламегаситель", "микроволновка", "воспламенение", "первопроходец",
    "электрогитара", "эффективность", "трансформатор","Антирад-обувь", "Антирад-штаны", "Безмятежность", "Бизнес-тренер", "Зомби-медведь",
    "Микроволновка", "Независимость", "Непробиваемый", "Неудержимость", "Палка-с-мясом",
    "Пламегаситель", "Превосходство", "Стекловолокно", "Трансформатор", "Электрогитара" ],
    14: ["Антирад-куртка", "Великобритания", "Преследователь","Расследование","предупреждение", "Гостеприимство", "путешественник"],
    15: ["Рейдер-костолом", "Электрокомфорка"],
    16: ["Энергосбережение"],
    17: ["Альфа-пробудитель", "Сумка-холодильник"],
    18: ["Сверхъестественное"]
};

const buttonContainer = document.getElementById('buttonContainer');
const letterInputs = document.getElementById('letterInputs');
const wrongLettersInput = document.getElementById('wrongLetters');


// Создание кнопок выбора количества букв
for (let i = 2; i <= 18; i++) {
  const button = document.createElement('button');
  button.textContent = i;
  button.addEventListener('click', function() {
    createLetterInputs(i);
  });
  buttonContainer.appendChild(button);
}

// По умолчанию создаем 5 полей для ввода букв
createLetterInputs(5);

// Создание полей для ввода букв в зависимости от выбранного количества
function createLetterInputs(count) {
  letterInputs.innerHTML = ''; // Очистка предыдущих полей
  
  for (let i = 0; i < count; i++) {
    const div = document.createElement('div');
    div.classList.add('letterInput');
    div.innerHTML = `
      <label for="letter${i + 1}">${i + 1}</label>
      <input type="text" class="letter" id="letter${i + 1}" maxlength="1">
    `;
    letterInputs.appendChild(div);
  }
}

// Проверка введенного слова
function checkWord() {
  const letters = document.querySelectorAll('.letter');
  const inputWord = Array.from(letters).map(input => input.value.toLowerCase() || '*').join('');

  // Получаем введенные пользователем буквы
  const excludeLettersInput = document.getElementById('excludeLetters');
  const excludeLetters = excludeLettersInput.value.toLowerCase().replace(/\s/g, '');

  const wordPerRowInput = document.getElementById('wordPerRow');
  const wordsPerRow = parseInt(wordPerRowInput.value);

  const matchedWords = words[inputWord.length].filter(word => {
    if (inputWord.length <= word.length) {
      return inputWord.split('').every((char, index) => char === '*' || char === word[index]) &&
             !Array.from(excludeLetters).some(excludeLetter => word.includes(excludeLetter)); // Исключаем слова, содержащие хотя бы одну из введенных букв
    }
    return false;
  });

  const resultContainer = document.getElementById('result');
  if (matchedWords.length > 0) {
    let tableHTML = '<div class="table">';
    for (let i = 0; i < matchedWords.length; i += wordsPerRow) {
      tableHTML += '<div class="row">';
      for (let j = i; j < i + wordsPerRow && j < matchedWords.length; j++) {
        tableHTML += `<div class="cell">${matchedWords[j]}</div>`;
      }
      tableHTML += '</div>';
    }
    tableHTML += '</div>';
    resultContainer.innerHTML = tableHTML;
  } else {
    resultContainer.innerHTML = 'Нет совпадений со словами из списка.';
  }
}
// Получаем ссылку на кнопку "Ввод"
const submitBtn = document.getElementById('submitBtn');

// Привязываем обработчик события к кнопке "Ввод"
submitBtn.addEventListener('click', function() {
  checkWord();
});

// Добавлены функции для увеличения и уменьшения количества слов в строке
function increment() {
  var input = document.getElementById('wordPerRow');
  if (parseInt(input.value) < parseInt(input.max)) {
    input.value++;
    checkWord();
  }
}

function decrement() {
  var input = document.getElementById('wordPerRow');
  if (parseInt(input.value) > parseInt(input.min)) {
    input.value--;
    checkWord();
  }
}
function checkWord() {{
  const letters = document.querySelectorAll('.letter');
  const inputWord = Array.from(letters).map(input => input.value.toLowerCase() || '*').join('');

  const excludeLettersInput = document.getElementById('excludeLetters');
  const excludeLetters = excludeLettersInput.value.toLowerCase().replace(/\s/g, '');

  const wordPerRowInput = document.getElementById('wordPerRow');
  const wordsPerRow = parseInt(wordPerRowInput.value);

  const usedLetters = {};
  letters.forEach(letter => {
    if (letter.value.trim() !== '') {
      const letterValue = letter.value.toLowerCase();
      if (usedLetters[letterValue]) {
        usedLetters[letterValue]++; // увеличиваем счетчик повторений буквы
      } else {
        usedLetters[letterValue] = 1; // иначе инициализируем счетчик повторений буквы
      }
    }
  });

  const matchedWords = words[inputWord.length].filter(word => {
    if (inputWord.length <= word.length) {
      const lowerCaseWord = word.toLowerCase();
      return inputWord.split('').every((char, index) => char === '*' || char === lowerCaseWord[index]) &&
             !Array.from(excludeLetters).some(excludeLetter => lowerCaseWord.includes(excludeLetter)) &&
             !Array.from(Object.keys(usedLetters)).some(usedLetter => {
               const count = lowerCaseWord.split(usedLetter).length - 1; // подсчитываем количество вхождений буквы в слове
               return count > usedLetters[usedLetter]; // проверяем, что буква не встречается более раза
             });
    }
    return false;
  });

  // Приводим все слова к нижнему регистру
  const lowerCaseMatchedWords = matchedWords.map(word => word.toLowerCase());

  // Удаляем повторяющиеся слова с учетом регистра первой буквы
  const uniqueMatchedWords = [];
  const uniqueWordsSet = new Set();

  lowerCaseMatchedWords.forEach((word, index) => {
    if (!uniqueWordsSet.has(word)) {
      uniqueMatchedWords.push(matchedWords[index].toLowerCase());
      uniqueWordsSet.add(word);
    }
  });

  const resultContainer = document.getElementById('result');
  if (uniqueMatchedWords.length > 0) {
    let tableHTML = '<div class="table">';
    for (let i = 0; i < uniqueMatchedWords.length; i += wordsPerRow) {
      tableHTML += '<div class="row">';
      for (let j = i; j < i + wordsPerRow && j < uniqueMatchedWords.length; j++) {
        tableHTML += `<div class="cell">${uniqueMatchedWords[j]}</div>`;
      }
      tableHTML += '</div>';
    }
    tableHTML += '</div>';
    resultContainer.innerHTML = tableHTML;
  } else {
    resultContainer.innerHTML = 'Нет совпадений со словами из списка.';
  }
}



  
  // Очищаем уведомление
  const notificationContainer = document.getElementById('notificationContainer');
  notificationContainer.textContent = '';
}


// Привязываем функцию к событию input поля "Отображение строк по:"
document.getElementById('wordPerRow').addEventListener('input', checkWordPerRow);

// Функция для показа уведомления
function showNotification(message) {
  const notificationContainer = document.getElementById('notificationContainer');
  notificationContainer.textContent = message;
}

// Проверка введенного значения количества слов в строке
function checkWordPerRow() {
  const wordPerRowInput = document.getElementById('wordPerRow');
  const wordPerRowValue = parseInt(wordPerRowInput.value);

  // Если введенное значение больше 20
  if (wordPerRowValue > 20) {
    showNotification('Нельзя отобразить более 20 ячеек в строке!!!');
  } else {
    // Если значение в допустимых пределах, очищаем уведомление
    hideNotification();
  }
}

// Функция для скрытия уведомления
function hideNotification() {
  const notificationContainer = document.getElementById('notificationContainer');
  notificationContainer.textContent = '';
}

// Привязываем функцию к событию input поля "Отображение строк по:"
document.getElementById('wordPerRow').addEventListener('input', checkWordPerRow);



const buttons = document.querySelectorAll('#buttonContainer button');
let currentButton = null; // Переменная для хранения текущей выбранной кнопки

// Проходимся по каждой кнопке и добавляем обработчик события клика
buttons.forEach(button => {
  button.addEventListener('click', function() {
    // Убираем красный цвет с предыдущей выбранной кнопки
    if (currentButton !== null) {
      currentButton.style.backgroundColor = '#4CAF50';
    }
    // Присваиваем текущей кнопке красный цвет
    button.style.backgroundColor = 'red';
    currentButton = button; // Обновляем текущую выбранную кнопку
    
    // Получаем количество букв из текста кнопки и создаем соответствующее количество полей ввода
    const count = parseInt(button.textContent);
    createLetterInputs(count);
  });
});

// По умолчанию первая кнопка (5) будет красной
if (buttons.length > 0) {
  buttons[3].style.backgroundColor = 'red';
  currentButton = buttons[3];
}

function submitClicked() {
  const submitBtn = document.getElementById('submitBtn');
  submitBtn.classList.add('clicked'); // добавляем класс, чтобы изменить стиль кнопки
  setTimeout(() => {
    submitBtn.classList.remove('clicked'); // удаляем класс через небольшую задержку, чтобы анимация завершилась
  }, 300);
  // добавьте здесь ваш код для выполнения действия при нажатии на кнопку
}

// Получаем ссылку на поле ввода количества допустимых ячеек
const wordPerRowInput = document.getElementById('wordPerRow');

// Добавляем обработчик события input для поля ввода
wordPerRowInput.addEventListener('input', function() {
  // Очищаем результаты при изменении значения в поле ввода
  const resultContainer = document.getElementById('result');
  resultContainer.innerHTML = '';
});


// Проходимся по каждой кнопке и добавляем обработчик события клика
buttons.forEach(button => {
  button.addEventListener('click', function() {
    // Очищаем поле с неправильными буквами
    const excludeLettersInput = document.getElementById('excludeLetters');
    excludeLettersInput.value = ''; // Очищаем содержимое поля

    // Убираем красный цвет с предыдущей выбранной кнопки
    if (currentButton !== null) {
      currentButton.style.backgroundColor = '#4CAF50';
    }
    // Присваиваем текущей кнопке красный цвет
    button.style.backgroundColor = 'red';
    currentButton = button; // Обновляем текущую выбранную кнопку
    
    // Получаем количество букв из текста кнопки и создаем соответствующее количество полей ввода
    const count = parseInt(button.textContent);
    createLetterInputs(count);
  });
});

// Получаем ссылку на поле ввода
const wordInput = document.getElementById('wordInput');


// Функция для создания полей ввода букв
function createLetterInputs(count) {
  letterInputs.innerHTML = ''; // Очищаем предыдущие поля ввода
  
  for (let i = 0; i < count; i++) {
    const div = document.createElement('div');
    div.classList.add('letterInput');
    div.innerHTML = `
      <label for="letter${i + 1}">${i + 1}:</label>
      <input type="text" class="letter squareInput" id="letter${i + 1}" maxlength="1" tabindex="${i + 1}">
    `;
    letterInputs.appendChild(div);
  }

  // Добавляем обработчики событий для перемещения между полями ввода при помощи клавиш "вверх" и "вниз"
  const letterInputsList = document.querySelectorAll('.letterInput input');
  letterInputsList.forEach((input, index) => {
    input.addEventListener('keydown', function(event) {
      const currentTabIndex = parseInt(input.getAttribute('tabindex'));
      let nextIndex;
      if (event.key === 'ArrowLeft') {
        nextIndex = currentTabIndex - 1;
      } else if (event.key === 'ArrowRight') {
        nextIndex = currentTabIndex + 1;
      }
      if (nextIndex >= 1 && nextIndex <= count) {
        const nextInput = document.querySelector(`.letterInput input[tabindex="${nextIndex}"]`);
        nextInput.focus();
      }
    });
  });
}

const letterInputsList = document.querySelectorAll('.letterInput input');

letterInputsList.forEach((input, index) => {
  input.addEventListener('keydown', function(event) {
    if (event.key === 'ArrowDown') {
      // Получаем ссылку на поле ввода для неправильных букв
      const wrongLettersInput = document.getElementById('excludeLetters');
      // Перемещаем фокус на поле ввода для неправильных букв
      wrongLettersInput.focus();
      // Предотвращаем дальнейшее действие по умолчанию для клавиши "стрелка вниз"
      event.preventDefault();
    }
  });
});

// Создаем новую переменную для поля ввода неправильных букв
const excludeLettersInput = document.getElementById('excludeLetters');

// Добавляем обработчик события keydown к полю ввода неправильных букв
excludeLettersInput.addEventListener('keydown', function(event) {
  if (event.key === 'ArrowUp') {
    // Получаем ссылку на первое поле ввода букв
    const firstLetterInput = document.querySelector('.letterInput input');
    // Перемещаем фокус на первое поле ввода букв
    firstLetterInput.focus();
    // Предотвращаем дальнейшее действие по умолчанию для клавиши "стрелка вверх"
    event.preventDefault();
  }
});

